# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C"
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B"
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F"
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [3]:
#your code
df['cabin_letter'] = df.Cabin.str.get(0)

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [4]:
C_df = df['cabin_letter'].value_counts(dropna=False)
C_df

cabin_letter
NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: count, dtype: int64

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [ ]:
df_ct = pd.crosstab(df.cabin_letter, df.Survived, margins=False)
df_ct #C มีจำนวนผู้เสียชีวิตเยอะสุด

3. cabin ใดมีค่า สัดส่วน จำนวนผู้รอดชีวิตหารด้วยจำนวนผู้เสียชีวิต สูงสุด

In [6]:
surv_div_death = df_ct[1]/df_ct[0]
surv_div_death #D มีค่าสัดส่วนจำนวนผู้รอดชีวิตหารด้วยจำนวนผู้เสียชีวิตสูงสุด

cabin_letter
A    0.875000
B    2.916667
C    1.458333
D    3.125000
E    3.000000
F    1.600000
G    1.000000
T    0.000000
dtype: float64

4. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [38]:
CxF = df.groupby('cabin_letter')['Fare'].mean().sort_values().tail(1)
display(CxF)
#cabin B มีค่าเฉลี่ยตั๋วสูงสุด

cabin_letter
B    113.505764
Name: Fare, dtype: float64

5. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [14]:
df.groupby(['cabin_letter', 'Survived'])['Fare'].mean() 
#จะพบว่าผู้รอดชีวิตจะมีอัตราการจ่ายค่าตัวเฉลี่ยเยอะกว่าผู้รอดชีวิตใน Cabin เดียวกัน

cabin_letter  Survived
A             0            35.496350
              1            44.341071
B             0            57.137500
              1           132.832026
C             0            99.972396
              1           100.274046
D             0            53.770825
              1            58.356176
E             0            43.715625
              1            46.797050
F             0            11.340000
              1            23.294787
G             0            10.462500
              1            16.700000
T             0            35.500000
Name: Fare, dtype: float64

6. ในแต่ละอักษร cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [13]:
cabin_Pclass_ct = pd.crosstab(df.cabin_letter, df.Pclass)
cabin_Pclass_ct

Pclass         1  2  3
cabin_letter
A             15  0  0
B             47  0  0
C             59  0  0
D             29  4  0
E             25  4  3
F              0  8  5
G              0  0  4
T              1  0  0